Repository: hezbims/Backend-Inventory-System-NET
Catalog: Inv_Backend_NET/Resources/Transaction.*.resx
Languages: id

# creator_is_empty
source: Application error. 'Creator' is not filled
id: Terjadi error aplikasi. 'Creator' tidak terisi

# transaction_time_must_filled
source: Transaction time must be filled
id: Waktu transaksi harus diisi

# group_id_must_filled
source: Group must be filled
id: Grup harus diisi

# transaction_type_must_filled
source: Transaction type must be filled
id: Tipe transaksi harus diisi

# transaction_type_must_be_in_or_out
source: Transaction type must be either "IN" or "OUT"
id: Tipe transaksi harus "IN" atau "OUT"

# transaction_items_must_have_1_item
source: Transaction items must have at least 1 item
id: Setidaknya harus ada 1 barang transaksi yang dipilih

# transaction_item_product_id_is_not_filled
source: Product id at position '{0}' is not filled
id: Id barang pada posisi '{0}' tidak terisi

# expected_quantity_is_not_filled
source: Expected quantity at position '{0}' is not filled
id: Expected quantity pada posisi '{0}' tidak teriisi

# transaction_items_is_null
source: Transaction items json key doesn't exists
id: Key json transaction items harus tersedia

# can_not_cancel_other_user_transaction
source: You can't cancel other user transaction
id: Anda tidak dapat membatalkan transaksi milik pengguna lain

# can_not_cancel_transaction_with_empty_notes
source: Can't cancel transaction with empty notes
id: Tidak dapat membatalkan transaksi tanpa menginputkan catatan

# can_not_cancel_rejected_transaction
source: Can't cancel rejected transaction
id: Transaksi yang sudah ditolak tidak dapat dibatalkan

# transaction_can_not_canceled_twice
source: Transaction can't canceled multiple times
id: Tidak dapat membatalkan transaksi berkali-kali

# non_admin_can_not_assign_supplier_group
source: You can't assign transaction to supplier group
id: Anda tidak dapat menetapkan transaksi kepada grup pemasok

# prepared_quantity_must_filled
source: Prepared quantity at {0}-th position must filled
id: Jumlah yang disiapkan pada posisi ke-%s harus diisi

# transaction_items_size_must_be_same
source: The amount of items must be same as previous
id: Jumlah item harus sama dengan sebelumnya

# transaction_item_expected_quantity_must_be_positive
source: Expected quantity must greater than 0
id: Jumlah yang diharapkan harus lebih dari 0

# transaction_item_prepared_quantity_must_not_be_negative
source: Prepared quantity must not be negative number
id: Jumlah yang disiapkan tidak boleh bilangan negatif

# transaction_item_prepared_quantity_cant_be_greater_than_expected_quantity
source: Prepared quantity can't be greater than expected quantity
id: Jumlah yang disiapkan tidak boleh lebih dari jumlah yang diharapkan

# admin_can_not_confirm_transaction
source: Admin can't confirm a transaction
id: Admin tidak boleh mengkonfirmasi transaksi

# non_admin_can_not_confirm_other_user_transaction
source: You can't confirm other user transaction
id: Anda tidak dapat mengkonfirmasi transaksi milik pengguna lain

# non_admin_can_only_confirm_prepared_transaction
source: You can only confirm transaction with status 'prepared'
id: Anda hanya dapat mengkonfirmasi transaksi dengan status 'sudah siap'

# admin_can_not_assign_to_other_admin
source: You can't assign transaction to other admin
id: Anda tidak dapat menyerahkan transaksi pada user admin

# non_admin_can_not_create_transaction_of_type_in
source: You can't create transaction of type 'Stock-In'
id: Anda tidak dapat membuat transaksi bertipe 'Stock-masuk'

# group_id_not_found
source: Group with id '{0}' is not found.
id: Grup dengan id '%s' tidak ditemukan.

# only_waiting_transaction_can_be_prepared
source: Only transaction with status 'waiting' can be prepared
id: Hanya transaksi dengan status 'menungu' bisa disiapkan

# non_admin_can_not_prepare_transaction
source: You are not authorized to prepare transaction
id: Anda tidak berhak untuk menyiapkan sebuah transaksi

# non_admin_can_not_reject_transaction
source: You are not authorized to reject a transaction
id: Anda tidak berhak untuk menolak sebuah transaksi

# only_waiting_and_prepared_transaction_can_be_rejected
source: You can only reject a transaction with status 'waiting' or 'prepared'
id: Anda hanya dapat menolak transaksi yang statusnya 'menunggu' atau 'sudah siap'

# rejection_notes_must_not_be_empty
source: Notes can't be empty when you reject the transaction
id: Catatan tidak boleh kosong ketika anda menolak sebuah transaksi

# admin_can_only_updated_prepared_transaction
source: You can only update a transaction with status 'prepared'
id: Anda hanya dapat memperbarui transaksi dengan status 'sudah siap'

# non_admin_can_only_update_waiting_transaction
source: You can only update a transaction with status 'waiting'
id: Anda hanya dapat memperbaharui data transaksi yang statusnya 'menunggu'

# non_admin_can_only_update_their_own_transaction
source: You can't update a transaction from other user.
id: Anda tidak dapat memperbaharui data transaksi milik user lain.
